# Installs CLI tools & apps using homebrew

#
# bin
#

brew 'cloc'
brew 'cocoapods'
brew 'duti'
brew 'exiftool'
brew 'fd'
brew 'ffmpeg'
brew 'gibo'
brew 'git'
brew 'imagemagick'
brew 'python3'
brew 'ripgrep'
brew 'ruby'
brew 'tldr'
brew 'tree'
brew 'youtube-dl'

#
# app
#

# Uncomment the following to install apps for current user only
# cask_args appdir: '~/Applications'

cask '1password'
cask 'alfred'
cask 'appcleaner'
cask 'brave-browser'
cask 'calibre'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'fork' # CLI: /usr/local/bin/fork
cask 'hammerspoon'
cask 'iina' # CLI: /usr/local/bin/iina
cask 'iterm2'
cask 'itsycal'
cask 'keepingyouawake'
cask 'netnewswire'
cask 'rectangle'
cask 'selfcontrol'
cask 'sensiblesidebuttons'
cask 'standard-notes'
cask 'sublime-text' # CLI: /usr/local/bin/subl
cask 'transmission'
cask 'visual-studio-code' # CLI: /usr/local/bin/code
